{
    "en": [
        {
            "id": 1,
            "version": "1.0.0",
            "releaseDate": "November 1st, 2024",
            "notes": [
                "Initial release with core functionalities.",
                "Improved performance and fixed minor bugs."
            ],
            "changelogDescription": "This version includes significant updates and improvements. Please refer to the official changelog for more details.",
            "changelogs": [
                {
                    "type": "features",
                    "message": "Added 6 new themes include 2 light themes, 3 unique themes and 1 theme from SoundScape."
                },
                {
                    "type": "features",
                    "message": "Introduced Coco Talk - new Chabox for enhanced user interaction. Users can now engage with the app through an interactive chat interface, asking questions, and receiving support in real-time."
                },
                {
                    "type": "features",
                    "message": "Implemented language change feature, allowing users to switch between multiple languages seamlessly."
                },
                {
                    "type": "improvements",
                    "message": "Enhanced color palette for better visibility."
                },
                {
                    "type": "improvements",
                    "message": "Enhanced email sending functionality for better reliability and user experience."
                },
                {
                    "type": "improvements",
                    "message": "Updated user interface for a more intuitive and engaging experience."
                }
            ],
            "description": "Version 1.0.0 introduces the first official release of the app, featuring a selection of themes, a new interactive chat feature, and several improvements for a smoother user experience."
        },
        {
            "id": 2,
            "version": "1.1.0",
            "releaseDate": "December 5th, 2024",
            "notes": [
                "Fixed bugs and improved the user interface.",
                "Added friendlier and clearer notifications.",
                "Added more translation."
            ],
            "changelogDescription": "This version includes minor updates and bug fixes. Please refer to the official changelog for more details.",
            "changelogs": [
                {
                    "type": "features",
                    "message": "Added dialog notifications for warnings, messages, errors, and more."
                },
                {
                    "type": "improvements",
                    "message": "Added more translation for pages (contact, about, articles, projects,...) and functionalities."
                },
                {
                    "type": "improvements",
                    "message": "Bug fixes and interface improvements for the project detail page."
                }
            ],
            "description": "Version 1.1.0 is a minor update focused on bug fixes and UI enhancements. This version also introduces improved notifications and translation support for a more user-friendly experience."
        },
        {
            "id": 3,
            "version": "1.1.5",
            "releaseDate": "January 11th, 2025",
            "notes": [
                "Exciting new animations!",
                "Sleek and improved interface."
            ],
            "changelogDescription": "This version brings delightful updates and small but impactful improvements! Check out the official changelog for all the details!",
            "changelogs": [
                {
                    "type": "features",
                    "message": "Added lively animations to make the app more fun and engaging!"
                },
                {
                    "type": "features",
                    "message": "Supports viewing and browsing multiple images in the article, allowing detailed view of each image and easy downloading."
                },
                {
                    "type": "improvements",
                    "message": "Enhanced skill charts to showcase your progress in a visually stunning way!"
                }
            ],
            "description": "Version 1.1.5 is a small but joyful update! We’ve introduced vibrant animations and improved the interface to make everything look and feel delightful. Try it now and experience the magic!"
        }
    ],
    "vi": [
        {
            "id": 1,
            "version": "1.0.0",
            "releaseDate": "1 tháng 11, 2025",
            "notes": [
                "Phát hành đầu tiên với các chức năng cơ bản.",
                "Cải thiện hiệu suất và sửa một số lỗi nhỏ.",
                "Effortlessly browse through multiple images in the article."
            ],
            "changelogDescription": "Phiên bản này bao gồm những cập nhật và cải tiến đáng kể. Vui lòng tham khảo changelog chính thức để biết thêm chi tiết.",
            "changelogs": [
                {
                    "type": "features",
                    "message": "Thêm 6 chủ đề mới bao gồm 2 màu chủ đề sáng, 3 màu chủ đề độc đáo và 1 màu chủ đề từ SoundScape."
                },
                {
                    "type": "features",
                    "message": "Giới thiệu Coco Talk - Chabox mới cho tương tác người dùng tốt hơn. Người dùng giờ đây có thể tương tác với ứng dụng thông qua giao diện trò chuyện, đặt câu hỏi và nhận hỗ trợ theo thời gian thực."
                },
                {
                    "type": "features",
                    "message": "Thực hiện chức năng thay đổi ngôn ngữ, cho phép người dùng chuyển đổi giữa nhiều ngôn ngữ một cách liền mạch."
                },
                {
                    "type": "improvements",
                    "message": "Cải thiện bảng màu cho khả năng nhìn tốt hơn."
                },
                {
                    "type": "improvements",
                    "message": "Cải thiện chức năng gửi email để nâng cao độ tin cậy và trải nghiệm người dùng."
                },
                {
                    "type": "improvements",
                    "message": "Cập nhật giao diện người dùng để mang lại trải nghiệm trực quan và hấp dẫn hơn."
                }
            ],
            "description": "Phiên bản 1.0.0 là bản phát hành chính thức đầu tiên của ứng dụng, với một loạt chủ đề, tính năng trò chuyện tương tác mới và nhiều cải tiến giúp trải nghiệm người dùng mượt mà hơn."
        },
        {
            "id": 2,
            "version": "1.1.0",
            "releaseDate": "5 tháng 12, 2024",
            "notes": [
                "Sửa các lỗi và cải thiện giao diện người dùng.",
                "Bổ sung thông báo thân thiện và rõ ràng hơn.",
                "Bổ sung thêm dịch thuật."
            ],
            "changelogDescription": "Phiên bản này bao gồm các cập nhật nhỏ và sửa lỗi. Vui lòng xem chi tiết tại changelog chính thức.",
            "changelogs": [
                {
                    "type": "features",
                    "message": "Thêm các hộp thoại thông báo để cảnh báo, thông báo, báo lỗi và nhiều chức năng khác."
                },
                {
                    "type": "improvements",
                    "message": "Bổ sung thêm dịch thuật cho các trang (trang liên hệ, giới thiệu, bài đăng, dự án,...) và chức năng."
                },
                {
                    "type": "improvements",
                    "message": "Sửa lỗi và cải thiện giao diện cho trang chi tiết dự án."
                }
            ],
            "description": "Phiên bản 1.1.0 là một bản cập nhật nhỏ, tập trung vào sửa lỗi và cải thiện giao diện người dùng. Phiên bản này cũng bổ sung thông báo được cải tiến và hỗ trợ dịch thuật, mang lại trải nghiệm thân thiện hơn cho người dùng."
        },
        {
            "id": 3,
            "version": "1.1.5",
            "releaseDate": "11 tháng 1, 2025",
            "notes": [
                "Hoạt ảnh mới thật sống động và thú vị!",
                "Giao diện được cải thiện để trông bắt mắt và dễ sử dụng hơn.",
                "Dễ dàng duyệt qua nhiều hình ảnh trong bài viết."
            ],
            "changelogDescription": "Phiên bản này mang đến những điều nhỏ xinh nhưng đầy ấn tượng! Hãy khám phá ngay chi tiết tại changelog chính thức nhé!",
            "changelogs": [
                {
                    "type": "features",
                    "message": "Thêm các hoạt ảnh sống động, khiến ứng dụng trở nên vui nhộn hơn bao giờ hết!"
                },
                {
                    "type": "features",
                    "message": "Hỗ trợ xem và duyệt qua nhiều hình ảnh trong bài viết, cho phép xem chi tiết từng ảnh và tải ảnh dễ dàng."
                },
                {
                    "type": "improvements",
                    "message": "Bổ sung biểu đồ kĩ năng siêu bắt mắt, giúp bạn thấy rõ hành trình 'level up' của mình!"
                }
            ],
            "description": "Phiên bản 1.1.5 là một bản cập nhật nhỏ nhưng ngập tràn niềm vui! Chúng tôi đã thêm những hoạt ảnh cực kỳ sống động và cải thiện giao diện để mọi thứ trở nên lung linh, vui tươi hơn. Hãy thử ngay và cảm nhận sự khác biệt!"
        },
        {
            "id": 4,
            "version": "1.2.0",
            "releaseDate": "29 tháng 1, 2025",
            "notes": [
                "✨ Bổ sung danh sách trò chơi đa dạng và đầy màu sắc!",
                "🎉 Thêm trò chơi mới: \"Trò chơi mật khẩu\" – thử thách trí thông minh và kỹ năng giải mã của bạn!"
            ],
            "changelogDescription": "Hãy khám phá ngay những điểm mới thú vị trong bản cập nhật này tại changelog chính thức nhé! 🚀",
            "changelogs": [
                {
                    "type": "features",
                    "message": "📜 Bổ sung danh sách trò chơi mới lạ và hấp dẫn!"
                },
                {
                    "type": "features",
                    "message": "🔐 Thêm \"Trò chơi mật khẩu\" – sẵn sàng để bạn khám phá và chinh phục!"
                }
            ],
            "description": "Phiên bản 1.2.0 là một bản cập nhật nhỏ nhưng chứa đựng niềm vui bất ngờ! Hãy sẵn sàng để khám phá và thử thách bản thân với những nội dung mới tuyệt vời! 🌟"
        }
    ]
}